Repository: imjayyy/django-autotrader
Catalog: autotrader/locale/*/LC_MESSAGES/django.po
Languages: az

source: Search results
az: Axtarış nəticələri

source: My Multilingual Site
az: Mənim Çoxdilli Saytım

source: Car Details
az: Maşın Məlumatları

source: Home
az: Ana səhifə

source: Order your car from the USA to Azerbaijan
az: Maşını ABŞ-dan Azərbaycana sifariş edin

source: Choose from over 181,745 used Cars, Trucks, and SUVs
az: 181,745-dən çox ikinci əl maşın, yük maşını və SUV-lərdən seçin

source: Find Your Car
az: Maşını Tapın

source: Browse vehicles in Azerbaijan, ready for you to drive home today.
az: Azərbaycanda sizə bu gün sürməyə hazır olan nəqliyyat vasitələrini araşdırın.

source: View Full Inventory
az: Bütün Inventarı Görüntüləyin

source: Get Expert Help for Your Vehicle Purchase
az: Nəqliyyat Vasitəsi Alışınız üçün Ekspert Köməyi Alın

source: Enter your phone number, and our team will contact you
az: Telefon nömrənizi daxil edin, komandamız sizinlə əlaqə saxlayacaq

source: Auto Trader LLC imports quality vehicles from the USA, Europe, and Asia, handling every step from purchase to shipping and customs. Enjoy a seamless experience with key pickup right here in Azerbaijan – we take care of all the processes for you.
az: Auto Trader MMC ABŞ-dan, Avropadan və Asiyadan keyfiyyətli nəqliyyat vasitələri idxal edir, alışdan göndərişə və gömrükdən hər bir addımı idarə edir. Azərbaycanda ümumilikdə açar təhvil götürmə ilə problemsiz təcrübə yaşayın – bütün prosesləri sizin üçün biz idarə edirik.

source: Useful Links
az: Faydalı Keçidlər

source: Auction
az: Auktsion

source: Shipping
az: Göndərmə

source: Electric Vehicles
az: Elektrik Nəqliyyat Vasitələri

source: Import Auto
az: Maşın İdxalı

source: Contact Us
az: Bizimlə Əlaqə

source: Heydar Aliyev Ave 115, Sport Plaza Hotel & Apartments 187B
az: Heydər Əliyev Prospekti 115, Sport Plaza Hotel & Apartments 187B

source: Monday-Friday, 09:00-18:00
az: Bazar ertəsi - Cümə, 09:00-18:00

source: HOME
az: ANA SƏHİFƏ

source: CALCULATOR
az: HESABLAMA

source: NOTIFICATION
az: BİLDİRİŞ

source: PROFILE
az: PROFİL

source: Active Lots
az: Aktiv Lotlar

source: Auction History
az: Auktsion Tarixi

source: Auction Calculator
az: Auktsion Hesablama

source: Shipping Calculator
az: Göndərmə Hesablama

source: Tracking
az: İzləmə

source: My Account
az: Mənim Hesabım

source: My Orders
az: Mənim Sifarişlərim

source: Log Out
az: Çıxış

source: More
az: Daha çox

source: About Us
az: Haqqımızda

source: Contact
az: Əlaqə

source: Information
az: Məlumat

source: Select Language
az: Dil Seçin

source: EN
az: İNGİLİS

source: AZ
az: AZƏRBAYCAN
